{"current_room": "Storage", "inventory": ["CafeKey"], "tasks": {"Cafe": {"status": "incomplete", "description": "", "item": "CafeKey"}, "Electrical": {"status": "incomplete", "description": "\nTask: You need a ToolBox to repair Electricity", "item": "ToolBox"}, "Engine": {"status": "incomplete", "description": "\nTask: You need a PowerCore to repair the engines", "item": "PowerCore"}, "O2": {"status": "incomplete", "description": "\nTask: You need a LaserGun to kill the Alien", "item": "LaserGun"}, "Navigation": {"status": "incomplete", "description": "\nTask: You need to complete the word. Hints are in different rooms", "word": "Imposter"}}, "items": {"CafeKey": {"description": "A key for the cafe. You can use it to unlock the door to the cafe."}, "PowerCore": {"description": "A power core that can be used to repair the engines."}, "ToolBox": {"description": "A toolbox that can be used to fix the electrical system."}, "LaserGun": {"description": "A laser gun that can be used to kill the alien."}, "FirstAidKit": {"description": "A first aid kit that can be used to heal yourself."}, "Torch": {"description": "A torch that can be used to see when electricity malfunctions."}}, "rooms": {"Admin": {"description": "The nerve center of the ship, filled with blinking consoles, star charts, and system diagnostics. A key for the Café lies on the floor. The ship feels eerily quiet as warnings flash about engine malfunctions. The soft glow of distant stars outside the main viewport gives a sense of isolation.'", "exits": {"north": "Hallway", "south": "O2"}, "items": [], "locked": false, "task_req": ""}, "Hallway": {"description": "A long corridor, dimly lit, with flickering lights casting eerie shadows. The hum of the ship’s systems echoes throughout, though now it feels a little strained. The doors lead to various parts of the ship. You feel a growing sense of urgency.", "exits": {"north": "Cafe", "south": "Admin", "east": "Engine", "west": "Storage"}, "items": [], "locked": false, "task_req": ""}, "Cafe": {"description": "Once a lively hub for the crew, this room is now deserted. Tables are overturned, and a half-empty mug sits abandoned. A vending machine hums softly in the corner, though it looks broken. The Café key you picked up earlier opens the door, and inside, you spot a torch, which might come in handy in case of emergencies—like the lights going out.", "exits": {"north": "Electrical", "south": "Hallway"}, "items": ["Torch"], "locked": true, "task_req": "This room is locked. You need a CafeKey to unlock it."}, "Engine": {"description": "This room houses the beating heart of the ship. The engines rumble with an irregular rhythm, and steam hisses from cracked pipes. Something is definitely wrong here. Tools and scattered debris suggest someone was trying to make a repair but abandoned the effort. The ship won't function without this getting fixed. The power core is missing and needs to be retrieved.", "exits": {"west": "Hallway"}, "items": [], "locked": false, "task_req": ""}, "Storage": {"description": "A cramped room with rows of metal shelves stacked high with crates and supplies. The hum of machines and the stale smell of metal fills the air. The Power Core is stored here, along with other vital supplies for ship repairs. You also spot a toolbox on one of the shelves, which may come in handy later.", "exits": {"east": "Hallway", "west": "Navigation"}, "items": ["PowerCore", "ToolBox"], "locked": false, "task_req": ""}, "Electrical": {"description": "This small room is filled with exposed wires and flickering monitors. The smell of burnt circuits and the occasional spark from damaged equipment makes this a hazardous environment. You’ll need the toolbox from the Storage Room to fix the ship’s power supply. Be careful—this room is the key to restoring the lights and continuing the mission.", "exits": {"south": "Cafe"}, "items": ["LaserGun"], "locked": true, "task_req": "There is no light in this room. You might need a torch to fix it."}, "Navigation": {"description": "A quiet, dimly lit room with a large console displaying the ship’s trajectory and various star charts. A malfunctioning navigational system blinks urgently, displaying coordinates that don’t make sense. To proceed, you'll need to solve a puzzle involving the star charts to realign the ship's course and unlock further data about your mission’s destination.", "exits": {"east": "Storage"}, "items": [], "locked": true, "task_req": "This room is out of bound for now. Complete All Tasks first!"}, "O2": {"description": "A small, vital room filled with oxygen tanks and air-purification systems. The hiss of leaking gas fills the air, but something feels off. You can see faint signs of tampering. You notice the air thinning—this could get dangerous quickly. The room seems to have been disturbed recently.", "exits": {"north": "Admin", "east": "MedBay"}, "items": [], "locked": true, "task_req": "Uh Oh! It seems like Electrical isn't fixed. Fix Electrical first!"}, "MedBay": {"description": "A sterile white room with medical beds and equipment neatly arranged. The faint smell of antiseptic lingers. It seems untouched by the chaos, but you feel a wave of unease. You know you may need this room if things turn worse.", "exits": {"west": "O2"}, "items": ["FirstAid"], "locked": false, "task_req": ""}}}